import random


def game_stone_scissors_paper(game_input):
    game_choose = ['камень', 'ножницы', 'бумага']

    game_choose_bot = random.choice(game_choose)
    if game_choose_bot == game_input:
        return {
            'game_choose_bot' : game_choose_bot,
            'game_res' : 'Ничья 🟡😐🟡'
        }
    elif (game_input == 'камень' and game_choose_bot == 'ножницы') or (
            game_input == 'ножницы' and game_choose_bot == 'бумага') or (
            game_input == 'бумага' and game_choose_bot == 'камень'):
        return {
            'game_choose_bot': game_choose_bot,
            'game_res': 'Ты победил 🟢😁🟢'
        }
    else:
        return {
            'game_choose_bot': game_choose_bot,
            'game_res': 'Ты проиграл ⛔😕⛔'
        }

def game_guess_number(user_number):
    max_range = random.randint(5, 15)
    random_number = str(max_range)
    #user_number = int(input(f'Введите случайное число в диапазоне от {min_range} до {max_range}: '))

    if random_number == user_number:

        return {
            'game_choose_bot': 'Так держать 🟢😁🟢',
            'game_res': f'Поздравляю!!! Вы угадали число'
        }
    else:
        return {
            'game_choose_bot' : 'Может в следующий раз повезёт ⛔😕⛔',
            'game_res': f'К сожалению, вы не угадали число. Загаданное число: {random_number}'
        }
used = []
cities = ['абакан', 'абинск', 'агидель', 'агрыз', 'адыгейск', 'азнакаево', 'азов', 'ак-довурак', 'аксай', 'алагир', 'алапаевск', 'алатырь', 'алдан', 'алейск', 'александров', 'александровск', 'александровск-сахалинский', 'алексеевка', 'алексин', 'алзамай', 'альметьевск', 'амурск', 'анадырь', 'анапа', 'ангарск', 'андреаполь', 'анжеро-судженск', 'анива', 'апатиты', 'апрелевка', 'апшеронск', 'арамиль', 'аргун', 'ардатов', 'ардон', 'арзамас', 'аркадак', 'армавир', 'арсеньев', 'артем', 'артемовск', 'артемовский', 'архангельск', 'асбест', 'асино', 'астрахань', 'аткарск', 'ахтубинск', 'ачинск', 'аша', 'бабаево', 'бабушкин', 'бавлы', 'багратионовск', 'байкальск', 'баймак', 'бакал', 'баксан', 'балаково', 'балахна', 'балашиха', 'балашов', 'балей', 'балтийск', 'барыш', 'батайск', 'бахчисарай', 'бежецк', 'белая калитва', 'белая холуница', 'белгород', 'белебей', 'белев', 'белинский', 'белово', 'белогорск', 'белозерск', 'белокуриха', 'беломорск', 'белорецк', 'белореченск', 'белоярский', 'белый', 'белев', 'бердск', 'березники', 'березовский', 'беслан', 'бикин', 'билимбай', 'билий', 'бийск', 'биробиджан', 'благовещенск', 'благодарный', 'бобров', 'богданович', 'богородицк', 'богородск', 'боготол', 'богучар', 'бодайбо', 'бокситогорск', 'болгар', 'бологое', 'болохово', 'болохово', 'болхов', 'большой камень', 'бор', 'бозяк', 'борисоглебск', 'боровичи', 'боровск', 'бородулино', 'бородино', 'братск', 'бронницы', 'брянск', 'бугульма', 'бугуруслан', 'буденновск', 'бузулук', 'буинск', 'буйнакск', 'буй', 'бутурлиновка', 'валуйки', 'васильсурск', 'велиж', 'великие луки', 'великий новгород', 'великий устюг', 'вельск', 'венев', 'верещагино', 'верея', 'верхнеуральск', 'верхний тагил', 'верхний уфалей', 'верхняя пышма', 'верхняя салда', 'верхняя тура', 'весьегонск', 'ветлуга', 'вилючинск', 'вилюйск', 'видное', 'вихоревка', 'вичуга', 'владивосток', 'владикавказ', 'владимир', 'волгоград', 'волгодонск', 'волгореченск', 'волжск', 'волжский', 'вологда', 'володарск', 'волоколамск', 'волос', 'волосово', 'вольск', 'воркута', 'воронеж', 'ворсма', 'воскресенск', 'воткинск', 'всеволожск', 'вуктыл', 'выборг', 'выкса', 'высоковск', 'высоцк', 'вытегра', 'вышний волочек', 'вяземский', 'вязники', 'вязьма', 'вятские поляны', 'гаврилов посад', 'гаврилов-ям', 'гагарин', 'гаджиево', 'гай', 'галич', 'гатчина', 'гвардейск', 'гдов', 'геленджик', 'георгиевск', 'глазов', 'голицыно', 'горно-алтайск', 'горнозаводск', 'горняк', 'горячий ключ', 'грайворон', 'гремячинск', 'грозный', 'грязи', 'грязовец', 'губаха', 'губкин', 'губкинский', 'гудермес', 'гуково', 'гулькевичи', 'гурьевск', 'гусев', 'гусиноозерск', 'гусь-хрустальный', 'давлеканово', 'дагестанские огни', 'далматово', 'дальнегорск', 'дальнереченск', 'данилов', 'данков', 'дегтярск', 'дедовск', 'демидов', 'дербент', 'десногорск', 'дзержинск', 'дзержинский', 'дивноморское', 'дивногорск', 'дигора', 'димитровград', 'дмитриев', 'дмитров', 'дмитровск', 'дно', 'добрянка', 'долгопрудный', 'долинск', 'домодедово', 'донецк', 'донской', 'дорогобуж', 'дрезна', 'дубна', 'дубовка', 'дудинка', 'духовщина', 'дятьково', 'евпатория', 'егорьевск', 'ейск', 'екатеринбург', 'елабуга', 'елец', 'елизово', 'ельня', 'еманжелинск', 'емва', 'енисейск', 'ермолино', 'ершов', 'ессентуки', 'ефремов', 'железноводск', 'железногорск', 'железногорск-илимский', 'железнодорожный', 'жердевка', 'жигулевск', 'жиздра', 'жирновск', 'жуков', 'жуковка', 'жуковский', 'завитинск', 'заводоуковск', 'заволжск', 'заволжье', 'задонск', 'заинск', 'закаменск', 'заозерный', 'заозерск', 'западная двина', 'заполярный', 'зарайск', 'заречный', 'заринск', 'звенигово', 'звенигород', 'зверево', 'зеленогорск', 'зеленоград', 'зеленоградск', 'зеленодольск', 'зеленокумск', 'зерноград', 'зея', 'зима', 'златоуст', 'злынка', 'змеиногорск', 'знаменск', 'зубцов', 'зуевка', 'ивангород', 'иваново', 'ивантеевка', 'ивдель', 'игарка', 'ижевск', 'избербаш', 'иланский', 'иннополис', 'инза', 'инсар', 'инта', 'ипатово', 'ирбит', 'иркутск', 'исилькуль', 'искитим', 'истра', 'ишим', 'ишимбай', 'йошкар-ола', 'кадников', 'казань', 'казельск', 'калач', 'калач-на-дону', 'калачинск', 'калининград', 'калиниск', 'калтан', 'калуга', 'калязин', 'камбарка', 'каменка', 'каменногорск', 'каменск-уральский', 'каменск-шахтинский', 'камень-на-оби', 'камешково', 'камызяк', 'камышин', 'камышлов', 'канаш', 'кандалакша', 'канск', 'капийск', 'карабаново', 'карабаш', 'карабулак', 'карачев', 'карасюк', 'каргат', 'каргополь', 'карпинск', 'карталы', 'кашин', 'касимов', 'касли', 'каспийск', 'кастрома', 'катав-ивановск', 'катайск', 'качканар', 'кашин', 'кашира', 'кедровый', 'кез', 'кемерово', 'кемь', 'кизель', 'кизилюрт', 'кизляр', 'кимовск', 'кимры', 'кинель', 'кинешма', 'кингсепп', 'киренск', 'киреевск', 'кириллов', 'кириши', 'киров', 'кировград', 'кирово-чепецк', 'кировск', 'кирсанов', 'киселевск', 'кисловодск', 'кичуй', 'клин', 'клинцы', 'княгинино', 'ковдор', 'ковров', 'ковылкино', 'когалым', 'кодинск', 'козельск', 'козловка', 'козьмодемьянск', 'кола', 'кологрив', 'коломна', 'кольчугино', 'коммунар', 'комсомольск', 'комсомольск-на-амуре', 'конанково', 'кондалакша', 'кондрово', 'копейск', 'кораблино', 'кореновск', 'коркино', 'королев', 'короча', 'корсаков', 'коряжма', 'костерево', 'костомукша', 'кострома', 'котельники', 'котельниково', 'котельнич', 'котлас', 'котово', 'котовск', 'кохма', 'красавино', 'красноармейск', 'красновишерск', 'красногорск', 'краснодар', 'краснозаводск', 'краснознаменск', 'краснокаменск', 'краснокамск', 'краснокумское', 'красноперекопск', 'краснослободск', 'краснотурьинск', 'красноуральск', 'красноуфимск', 'красноярск', 'красный кут', 'красный сулин', 'красный холм', 'кременки', 'кропоткин', 'крымск', 'кронштадт', 'кстово', 'кубинка', 'кувандык', 'кувшиново', 'кудымкар', 'кузнецк', 'куйбышев', 'кулебаки', 'кумертау', 'кунгур', 'купино', 'курган', 'курганинск', 'курильск', 'курлово', 'куровское', 'курск', 'курчатов', 'кушва', 'кувандык', 'кызыл', 'кыштым', 'кяхта', 'лабинск', 'лабытнанги', 'лагань', 'ладушкин', 'лаишево', 'лакинск', 'лангепас', 'лахденпохья', 'лебедянь', 'лениногорск', 'ленинск', 'ленинск-кузнецкий', 'лермонтов', 'лесное', 'лесной', 'лесозаводск', 'лесосибирск', 'ликино-дулево', 'липецк', 'липки', 'лиски', 'лихославль', 'лобня', 'лодейное поле', 'ломоносов', 'лосино-петровский', 'луга', 'лукоянов', 'луховицы', 'лысьва', 'лыткарино', 'льгов', 'люберцы', 'любим', 'людиново', 'лянтор', 'магадан', 'магас', 'магнитогорск', 'мадыш', 'майкоп', 'майский', 'макаров', 'макарьев', 'макушино', 'малая вишера', 'малгобек', 'малмыж', 'малоархангельск', 'малоярославец', 'мамадыш', 'мамоново', 'мантурово', 'мариинск', 'мариинский посад', 'маркс', 'махачкала', 'мглин', 'мегион', 'медвежьегорск', 'медногорск', 'медынь', 'межгорье', 'междуреченск', 'мезенск', 'мезень', 'меленки', 'мелеуз', 'менделеевск', 'мензелинск', 'мещовск', 'миасс', 'мичуринск', 'михайлов', 'михайловка', 'михайловск', 'микунь', 'миллерово', 'минеральные воды', 'минусинск', 'миньяр', 'мирный', 'михайловск', 'можайск', 'можга', 'моздок', 'мончегорск', 'морозовск', 'моршанск', 'москва', 'мосальск', 'муравленко', 'мураши', 'мурманск', 'муром', 'мценск', 'мыски', 'мытищи', 'мышкин', 'набережные челны', 'навашино', 'наволоки', 'надым', 'назарово', 'назрань', 'называевск', 'нальчик', 'нариманов', 'наро-фоминск', 'нарткала', 'нарьян-мар', 'находка', 'невель', 'невельск', 'невинномысск', 'невьянск', 'нелидово', 'неман', 'нерехта', 'нефтеюганск', 'нефтегорск', 'нефтекамск', 'нефтекумск', 'нея', 'нижневартовск', 'нижнекамск', 'нижнеудинск', 'нижние серги', 'нижний ломов', 'нижний новгород', 'нижний тагил', 'нижняя салда', 'нижняя тура', 'николаевск', 'николаевск-на-амуре', 'никольск', 'никольское', 'новая ладога', 'новая ляля', 'новоалександровск', 'новоалтайск', 'новоаннинский', 'нововоронеж', 'новодвинск', 'новозыбков', 'новокубанск', 'новокузнецк', 'новокуйбышевск', 'новомичуринск', 'новомосковск', 'новопавловск', 'новоржев', 'новороссийск', 'новосибирск', 'новосиль', 'новосокольники', 'новотроицк', 'новоузенск', 'новоульяновск', 'новоуральск', 'новохоперск', 'новочебоксарск', 'новочеркасск', 'новошахтинск', 'новый оскол', 'новый уренгой', 'ногинск', 'нолинск', 'норильск', 'ноябрьск', 'нурлат', 'нытва', 'нюрба', 'нягань', 'нязепетровск', 'няндома', 'облучье', 'обнинск', 'обоянь', 'обь', 'одинцово', 'ожерелье', 'озерск', 'озеры', 'октябрьск', 'октябрьский', 'окуловка', 'олекминск', 'оленегорск', 'олонск', 'олонец', 'омск', 'омутнинск', 'онега', 'опочка', 'орел', 'оренбург', 'орехово-зуево', 'орлов', 'орск', 'оса', 'осинники', 'осташков', 'остров', 'островной', 'острогожск', 'отрадное', 'отрадный', 'оханск', 'очер', 'ош', 'павлово', 'павловск', 'павловский посад', 'палласовка', 'партизанск', 'пачелма', 'певек', 'пенза', 'первомайск', 'первоуральск', 'перевоз', 'пересвет', 'переславль-залесский', 'пермь', 'пестово', 'петергоф', 'петрозаводск', 'петропавловск-камчатский', 'петухово', 'петушки', 'печора', 'печоры', 'пикалево', 'пионерский', 'питкяранта', 'плавск', 'пласт', 'плес', 'поворино', 'подольск', 'подпорожье', 'покачи', 'похвистнево', 'почеп', 'починок', 'полевской', 'полесск', 'полярные зори', 'полярный', 'поронайск', 'порхов', 'пошехонье', 'починок', 'правдинск', 'приволжск', 'приморск', 'приморско-ахтарск', 'приозерск', 'прокопьевск', 'пролетарск', 'протвино', 'прохладный', 'псков', 'пугачев', 'пудож', 'пустошка', 'пучеж', 'пушкино', 'пущино', 'пыталово', 'пыть-ях', 'пятигорск', 'радужный', 'райчихинск', 'раменское', 'рассказово', 'ревда', 'реж', 'реутов', 'ржев', 'рославль', 'россошь', 'ростов', 'ростов-на-дону', 'рошаль', 'рубцовск', 'рудня', 'руза', 'рузаевка', 'рыбинск', 'рыбное', 'рыльск', 'ряжск', 'рязань', 'салават', 'салаир', 'салехард', 'сальск', 'самара', 'санкт-петербург', 'саранск', 'сарапул', 'саратов', 'саров', 'сасово', 'сатка', 'сафоново', 'саяногорск', 'саянск', 'светлогорск', 'светлоград', 'светлый', 'светогорск', 'свирск', 'свободный', 'себеж', 'севан', 'северск', 'северобайкальск', 'северодвинск', 'северо-курильск', 'североморск', 'североуральск', 'северск', 'севск', 'сегежа', 'селижарово', 'семенов', 'семикаракорск', 'семилуки', 'сенгилей', 'серафимович', 'сергач', 'сергиев посад', 'сердобск', 'серов', 'серпухов', 'сертолово', 'сибай', 'сим', 'симферополь', 'скопин', 'ковородино', 'славгород', 'славск', 'славянск-на-кубани', 'сланцево', 'слободской', 'слюдянка', 'смоленск', 'снежинск', 'снежногорск', 'собинка', 'советск', 'советская гавань', 'советский', 'сокол', 'солигалич', 'соликамск', 'солнечногорск', 'соль-илецк', 'сольвычегодск', 'сольцы', 'сорочинск', 'сортвала', 'сосенский', 'сосновка', 'сосновоборск', 'сосновый бор', 'сосногорск', 'сочи', 'спас-деменск', 'спас-клепики', 'спасск', 'спасск-дальний', 'спасск-рязанский', 'среднеколымск', 'среднеуральск', 'сретенск', 'ставрополь', 'старая купавна', 'старая русса', 'старица', 'стародуб', 'старый оскол', 'стерлитамак', 'стрежевой', 'строитель', 'струнино', 'ступино', 'суворов', 'суджа', 'судогда', 'суздаль', 'суоярви', 'сураж', 'сургут', 'суровикино', 'сурск', 'сусуман', 'сухиничи', 'сухой лог', 'сызрань', 'сыктывкар', 'сысерть', 'сычевка', 'сясьстрой', 'тавда', 'таганрог', 'талдом', 'талица', 'тамбов', 'тара', 'тарко-сале', 'таруса', 'татарск', 'таштагол', 'тверь', 'тейково', 'темников', 'темрюк', 'терек', 'тетиев', 'тетиуши', 'тихорецк', 'тимашевск', 'тихвин', 'тихорецк', 'тобольск', 'тогучин', 'тольятти', 'томари', 'томмот', 'томск', 'топки', 'торопец', 'тосно', 'тотьма', 'трехгорный', 'троицк', 'трубчевск', 'туапсе', 'туймазы', 'тула', 'тулун', 'туран', 'туринск', 'тутаев', 'туймазы', 'тында', 'тырныауз', 'тюкалинск', 'тюмень', 'уварово', 'углегорск', 'углич', 'удачный', 'удомля', 'ужур', 'узловая', 'улан-удэ', 'ульяновск', 'унеча', 'урай', 'урень', 'уржум', 'урус-мартан', 'урюпинск', 'усинск', 'усмань', 'усолье', 'усолье-сибирское', 'уссурийск', 'усть-джегута', 'усть-илимск', 'усть-катав', 'усть-кут', 'усть-лабинск', 'устюжна', 'уфа', 'ухта', 'учалы', 'уяр', 'фатеж', 'фокино', 'фролово', 'фрязино', 'фурманов', 'хабаровск', 'хадыженск', 'ханты-мансийск', 'харабали', 'харовск', 'хасавюрт', 'хвощевка', 'хилок', 'химки', 'холм', 'холмск', 'хотьково', 'цивильск', 'цимлянск', 'чадан', 'чайковский', 'чапаевск', 'чаплыгин', 'чебаркуль', 'чебоксары', 'чегем', 'чекалин', 'челябинск', 'чердынь', 'черепаново', 'череповец', 'черкесск', 'чермоз', 'черноголовка', 'черногорск', 'чернушка', 'черняховск', 'черти', 'чехов', 'чистополь', 'чита', 'чкаловск', 'чудово', 'чулым', 'чусовой', 'чухлома', 'шадринск', 'шалы', 'шарыпово', 'шарья', 'шатск', 'шатура', 'шахтерск', 'шахты', 'шахунья', 'шацк', 'шебекино', 'шелехов', 'шенкурск', 'шилка', 'шимановск', 'шиханы', 'шлиссельбург', 'шумерля', 'шумиха', 'шуя', 'щекино', 'щелково', 'щербинка', 'щигры', 'электрогорск', 'электросталь', 'электроугли', 'элиста', 'энгельс', 'эртиль', 'юбилейный', 'югорск', 'южа', 'южно-сахалинск', 'южно-сухокумск', 'южноуральск', 'юрга', 'юрьев-польский', 'юрьевец', 'юрюзань', 'ютаза', 'юхнов', 'ядрино', 'якутск', 'ялта', 'ялуторовск', 'янаул', 'яранск', 'яровое', 'ярославль', 'ярцево', 'ясногорск', 'ясный', 'яхрома']
def game_towns(user_city):
    towns = ['абакан', 'архангельск', 'астрахань', 'барнаул', 'белгород', 'благовещенск', 'брянск', 'владивосток',
             'владикавказ', 'владимир', 'волгоград', 'вологда', 'воронеж', 'Донской', 'горно-алтайск', 'екатеринбург',
             'иваново', 'ижевск', 'иркутск', 'йошкар-ола', 'казань', 'калининград', 'калуга', 'кемерово', 'кострома',
             'краснодар', 'красноярск', 'курск', 'кызыл', 'магадан', 'магас', 'майкоп', 'махачкала', 'москва',
             'мурманск', 'нальчик', 'нарьян-мар', 'нижний новгород', 'новосибирск', 'орел', 'оренбург', 'пермь',
             'петрозаводск', 'псков', 'ростов-на-дону', 'рязань', 'салехард', 'самара', 'санкт-петербург', 'саранск',
             'саратов', 'севастополь', 'симферополь', 'смоленск', 'ставрополь', 'сыктывкар', 'тамбов', 'тверь', 'томск',
             'тула', 'тюмень', 'улан-удэ', 'ульяновск', 'уфа', 'хабаровск', 'ханты-мансийск', 'чебоксары', 'челябинск',
             'черкесск', 'чита', 'элиста', 'южно-сахалинск', 'якутск', 'ярославль']

    last_letter = ''
    while True:
        #user_city = input('Введите название города или "стоп" для выхода из игры: ').lower().strip()


        if last_letter and user_city[0] != last_letter:
            return {
                'game_res': f'Город должен начинаться на букву: {last_letter.upper()} ⛔.',
                'game_choose_bot' : 'Попробуйте снова'
            }

        if user_city in used:

            return {
                'game_res': f'Этот город уже был назван. ⛔',
                'game_choose_bot' : 'Попробуйте снова'
            }

        if user_city not in cities:
            return {
                'game_res': f'Такого города не существует! ⛔',
                'game_choose_bot' : 'Попробуйте снова'
            }

        used.append(user_city)


        idx = -1
        if user_city[idx] in 'ьъы':
            idx = -2
        last_letter = user_city[idx]

        bot_choice = ''
        for town in towns:
            if town.startswith(last_letter) and town not in used:
                bot_choice = town
                break

        if bot_choice:
            used.append(bot_choice)
            idx = -1
            if bot_choice[idx] in 'ьъы':
                idx = -2
            last_letter = bot_choice[idx]
            return {
                'game_res': f'{bot_choice.title()}.',
                'game_choose_bot' : f'Твой ход на: {last_letter.upper()}'
            }
        else:
            return {
                'game_res': f'Ты победил 🟢😁🟢',
                'game_choose_bot' : 'Так держать!!!'
            }

